package main

import (
	"fmt"
)

func main() {
	saplingLength := 100
	BambooBuff := 50
	BambooDebuff := 20
	fmt.Print("Что мы знаем о разведении бамбука в Мытищах?", "\n", "\n",
		"Длинна саженца при посадке составляет ", saplingLength, " сантиметров,", "\n",
		"За день бамбук отрастает на ", BambooBuff, " сантиметров,", "\n",
		"А гусеницы за ночь съедуют ", BambooDebuff, " сантиметров бамбука.", "\n", "\n",
		"Какой же удивительный мир Мытищинской природы!", "\n", "\n",
		"Тем не менее, давайте подсчитаем, потребулется времени нашему Babboo,", "\n", "чтобы тот вымахал на 3 метра.", "\n")

	dailyGrowth := BambooBuff - BambooDebuff
	daysToGrow := (300 - saplingLength) / dailyGrowth
	fmt.Print("С учётом ежежневного роста бамбука на 30 сантиметров и изначальной длинны,", "\n", "ему потребуется ", daysToGrow, " дней на рост до 3 метров.")
}
