package main

import "fmt"

func main() {
	fmt.Println("Количество зеркальных билетов среди всех шестизначных номеров")
	fmt.Println("от 100000 до 999999:")
	num := 0

	for i := 100000; i <= 999999; i++ {

		a := i / 100000
		b := (i - a*100000) / 10000
		c := (i - a*100000 - b*10000) / 1000
		d := (i - a*100000 - b*10000 - c*1000) / 100
		e := (i - a*100000 - b*10000 - c*1000 - d*100) / 10
		f := (i - a*100000 - b*10000 - c*1000 - d*100 - e*10)

		if a == f && b == e && c == d {
			num = num + 1
		}
	}
	fmt.Println(num)
}
